{
  "use_title": "Terms of Service",
  "use_content": "This document is a draft for reference only. Obtain legal advice before using it in production. Replace bracketed fields [ ] with actual values.\n\nVersion: v0.1\nEffective Date: [2025-08-10]\nService Name: pass_through (the “Service”)\nOperator: [Company/Individual] (the “Company”)\nBusiness Registration No.: [Number]\nContact: [Email/Phone]\n\nArticle 1 (Purpose)\nThese Terms set forth the rights, obligations, responsibilities, and procedures between the Company and Members in relation to the use of the Service provided by the Company.\n\nArticle 2 (Definitions)\n1) “Member”: a person who agrees to these Terms, enters into a service agreement with the Company, and uses the Service.\n2) “Personal Data Item”: sensitive information such as accounts/cards/IDs stored by a Member in the app; the Service stores it using end-to-end encryption (E2E).\n3) “Share Token (QR)”: a one-time access token generated by a Member to allow another person to view a specific item for a limited time.\n4) “Device Binding”: a security control that links a device to an account to prevent unauthorized use.\n\nArticle 3 (Effect and Amendment of the Terms)\n1) These Terms take effect when posted within the Service or otherwise notified.\n2) The Company may amend these Terms to the extent permitted by law. Changes will be announced at least 7 days prior to the effective date (30 days if unfavorable to Members).\n3) Members who do not agree to the changes may discontinue use and withdraw from the Service.\n\nArticle 4 (Formation of Agreement)\n1) The agreement is formed when the Member completes the required steps such as phone/email verification and PIN setup.\n2) The Company may refuse or later restrict use if: (i) another’s identity/information is used, (ii) laws or these Terms are violated, or (iii) serious technical/operational risks are posed.\n\nArticle 5 (Account Security and Authentication)\n1) Members must safely manage their access credentials, including PIN and biometrics.\n2) The Company uses OS-level biometric APIs and does not collect or store raw biometric data.\n3) Encryption/decryption is performed client-side with a key derived from the Member’s master PIN; the Company does not handle plaintext (see Privacy Policy).\n4) For security, re-authentication may be required after inactivity (e.g., after 5 minutes).\n\nArticle 6 (Provision and Changes of the Service)\n1) The Service includes: (i) secure storage of sensitive data (client-side encryption), (ii) item view/add/edit/delete, (iii) QR-based temporary sharing (default validity: [e.g., 30 minutes]), (iv) device binding and lock state management, and (v) notifications (local/remote).\n2) The Company may modify features to improve the Service; material changes will be announced in advance.\n\nArticle 7 (Cautions for Sharing)\n1) Members are responsible for issuing, delivering, and expiring Share Tokens.\n2) Share Tokens are one-time and time-limited; tokens/permissions may be stored short-term (e.g., in Redis) and are destroyed upon expiry.\n3) The Company is not liable for losses arising from recipient device or network security issues.\n\nArticle 8 (Member Obligations)\nMembers must comply with laws, these Terms, and Service guidelines. Prohibited acts include: identity theft, unlawful decryption/reverse engineering, excessive resource abuse, distribution of malware/spam, and illegal activities.\n\nArticle 9 (Company Obligations)\nThe Company protects Member information in accordance with laws and the Privacy Policy, strives to provide stable service, and restores disruptions without delay.\n\nArticle 10 (Service Suspension)\nThe Service may be suspended due to maintenance, facilities failure, or communication issues; planned suspensions will be announced in advance.\n\nArticle 11 (Intellectual Property)\nRights to the Service and related software/designs belong to the Company. Rights to content stored by Members belong to the Members; the Company processes it only to provide the Service.\n\nArticle 12 (Limitation of Liability)\nThe Company is not liable for damages caused by force majeure or the Member’s fault, nor for disputes between Members or with third parties.\n\nArticle 13 (Damages)\nIf a Member violates these Terms and causes damage to the Company, the Member shall compensate the Company.\n\nArticle 14 (Termination and Withdrawal)\nMembers may withdraw at any time via the app or customer support. Upon withdrawal, Member data is destroyed without delay except as required by law or internal policy.\n\nArticle 15 (Governing Law and Dispute Resolution)\nThese Terms are governed by the laws of the Republic of Korea. The competent court is [Court of Jurisdiction].\n\nSupplementary Provisions\nThese Terms take effect on [Effective Date].",
  "privacy_title": "Privacy Policy",
  "privacy_content": "This document is a draft for reference only. Adapt it to your actual operations (AWS region, processors, retention, etc.) and obtain legal advice.\n\nVersion: v0.1\nEffective Date: [2025-08-10]\nService Name: pass_through\nData Controller: [Company/Individual]\nContact: [Email/Phone]\nAddress: [Address]\n\n1. Purpose of Processing\nWe process the minimum personal data necessary for: account sign-up and verification (phone/email), account security and access control (PIN/biometric re-auth, device binding), provision/maintenance/improvement of the Service (bug/incident response), notifications (remote/local), and customer support.\n\n2. Categories of Personal Data\n(1) Account/Required: phone number, email (optional if designed so), nickname/alias, verification codes (OTP), tokens, device identifiers (app instance ID or push token), OS/app version, language/region, IP (logs).\n(2) Generated/Collected During Use: access/error logs (request URL, status code, timestamp, partial IP), push tokens (Expo/FCM/APNs), share token/QR metadata (token value, issued/expiry time, target item ID — plaintext is not stored).\n(3) Sensitive Content Data: account passwords, card/ID numbers, etc. are encrypted **on the client** (e.g., AES-GCM). The server stores only **ciphertext, salt, nonce, and KDF parameters**. The Company cannot access plaintext. Biometric data is handled by the OS; the Company does not collect or store raw biometrics.\n\n3. Processing and Retention Period\nAccount identifiers: until withdrawal (longer if required by law). Logs: retained for a minimal period for security/incident response and then destroyed (e.g., [3–6 months]). Share tokens/QR: destroyed immediately upon expiry (short-term store such as Redis).\n\n4. Provision to Third Parties\nWe do not provide personal data to third parties without consent, except as required by law or by a lawful request from authorities.\n\n5. Outsourcing (Processors)\nWe may outsource processing tasks for service operation, e.g.: Infrastructure: Amazon Web Services (AWS) — [Region], Push: Expo Push Service / Google FCM / Apple APNs, Analytics/Logs (optional): [e.g., Sentry, Datadog]. Specify processor, task, country/region, and contacts per actual contracts.\n\n6. Cross-Border Transfers\nDue to cloud/processing arrangements, data may be stored/processed on servers outside your country. Specify recipient, destination country, transfer time/method, and retention/use period (e.g., AWS [Region], Expo Push Service (US), etc.).\n\n7. Data Subject Rights\nYou may request access, rectification, deletion, or restriction; withdraw consent; and withdraw from the Service at any time via in-app settings or customer support (email/form).\n\n8. Destruction Procedures and Methods\nWe promptly destroy data when the purpose is achieved, the retention period expires, or consent is withdrawn. Electronic files: permanently deleted by irrecoverable methods. Paper/records: shredded or incinerated.\n\n9. Security Measures\nEnd-to-end encryption (E2E); key derivation (KDF, e.g., Argon2id — keys not stored server-side); TLS (HTTPS) in transit; access control and least privilege; separated storage of ciphertext and metadata; token TTL and immediate invalidation on expiry; app protections (screenshot/recording block, re-auth after inactivity); regular vulnerability checks and log monitoring.\n\n10. Children’s Privacy\nUsers under 14 may sign up only with verifiable parental consent. The verification procedure follows [Method].\n\n11. Cookies and Similar Technologies\nThe mobile app does not use web cookies. Device identifiers/tokens may be used for notification and security purposes.\n\n12. Data Protection Officer\nName: [Name] / Title: [Title] / Contact: [Email/Phone]\n\n13. Notice of Changes\nWe will notify changes to this Policy at least 7 days in advance (30 days for material changes) via in-app notices.\n\nSupplementary Provisions\nThis Policy takes effect on [Effective Date].",
  "scroll_notice": "You can check the box after scrolling each document to the bottom.",
  "scroll_hint_footer": "Please scroll to the bottom",
  "scroll_hint_row": "Please read to the end"
}